In [34]:
import pandas as pd
import numpy as np

In [66]:
people = {
    "first": ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'],
    "last": ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'],
    "email": ['CoreyMSchafter8@gmail.com', 'JaneDoe@gmail.com','JohnDoe@gmail.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    "age": ['33', '55', '63', '36', None, None, 'Missing']
}

In [78]:
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [79]:
df

   first     last                      email   age
0  Corey  Schafer  CoreyMSchafter8@gmail.com    33
1   Jane      Doe          JaneDoe@gmail.com    55
2   John      Doe          JohnDoe@gmail.com    63
3  Chris  Schafer                       None    36
4    NaN      NaN                        NaN  None
5   None      NaN        Anonymous@email.com  None
6    NaN      NaN                        NaN   NaN

In [80]:
df.dropna()

   first     last                      email age
0  Corey  Schafer  CoreyMSchafter8@gmail.com  33
1   Jane      Doe          JaneDoe@gmail.com  55
2   John      Doe          JohnDoe@gmail.com  63

In [81]:
df.dropna(axis='index', how='all', subset=['last','email'])

   first     last                      email   age
0  Corey  Schafer  CoreyMSchafter8@gmail.com    33
1   Jane      Doe          JaneDoe@gmail.com    55
2   John      Doe          JohnDoe@gmail.com    63
3  Chris  Schafer                       None    36
5   None      NaN        Anonymous@email.com  None

In [82]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [84]:
df.fillna(0)

   first     last                      email age
0  Corey  Schafer  CoreyMSchafter8@gmail.com  33
1   Jane      Doe          JaneDoe@gmail.com  55
2   John      Doe          JohnDoe@gmail.com  63
3  Chris  Schafer                          0  36
4      0        0                          0   0
5      0        0        Anonymous@email.com   0
6      0        0                          0   0

In [85]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [86]:
type(np.nan)

float

In [97]:
df['age'] = df['age'].astype(float)

In [98]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [99]:
df['age'].mean()

46.75